name: "CaffeNet"
layers {
  name: "source_ims"
  type: DATA
  top: "source_ims"
  data_param {
    source: "/scr/r6/tgebru/inverting_conv/caffe_invert_alexnet/data/siggraph/summer_test_227lmdb"
    backend: LMDB
    batch_size: 64
    #crop_size: 227
    mean_file: "/scr/r6/tgebru/timnit_caffe/data/ilsvrc12/imagenet_mean227.binaryproto"
    mirror: false
  }
}

layers {
  name:"target_ims" 
  type: DATA
  top: "target_ims"
  data_param {
    source: "/scr/r6/tgebru/inverting_conv/caffe_invert_alexnet/data/siggraph/winter_test_216lmdb"
    backend: LMDB
    batch_size: 64
    #crop_size: 216
    mean_file: "/scr/r6/tgebru/timnit_caffe/data/ilsvrc12/imagenet_mean216.binaryproto"
    mirror: false
  }
}

layers {
  name: "conv1"
  type: CONVOLUTION
  bottom: "source_ims"
  top: "conv1"
  blobs_lr: 0
  blobs_lr: 0
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 96
    kernel_size: 11
    stride: 4
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layers {
  name: "relu1"
  type: RELU
  bottom: "conv1"
  top: "conv1"
}
layers {
  name: "pool1"
  type: POOLING
  bottom: "conv1"
  top: "pool1"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layers {
  name: "norm1"
  type: LRN
  bottom: "pool1"
  top: "norm1"
  lrn_param {
    local_size: 5
    alpha: 0.0001
    beta: 0.75
  }
}
layers {
  name: "Rconv6"
  type: CONVOLUTION
  bottom: "norm1"
  top: "Rconv6"
  blobs_lr: 0
  blobs_lr: 0
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
  }
}
layers {
  name: "Rrelu6"
  type: RELU
  bottom: "Rconv6"
  top: "Rconv6"
}
layers {
  name: "Rconv7"
  type: CONVOLUTION
  bottom: "Rconv6"
  top: "Rconv7"
  blobs_lr: 0
  blobs_lr: 0
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    group: 2
  }
}
layers {
  name: "Rrelu7"
  type: RELU
  bottom: "Rconv7"
  top: "Rconv7"
}
layers {
  name: "Rconv8"
  type: CONVOLUTION
  bottom: "Rconv7"
  top: "Rconv8"
  blobs_lr: 0
  blobs_lr: 0
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    group: 2
  }
}
layers {
  name: "Rrelu8"
  type: RELU
  bottom: "Rconv8"
  top: "Rconv8"
}
layers {
  name: "deconv2"           
  type: DECONVOLUTION
  bottom: "Rconv8"
  top: "deconv2"
  blobs_lr: 0
  blobs_lr: 0
  weight_decay: 1
  weight_decay: 0
  deconvolution_param {
    output_channels: 64
    output_height: 54 
    output_width: 54
    pad: 2
    kernel_size: 5
    stride: 2
  }
}
layers {
  name: "relu_deconv2"
  type: RELU
  bottom: "deconv2"
  top: "deconv2"
  relu_param {
    negative_slope: 0.3
  }
}
layers {
  name: "deconv1"           
  type: DECONVOLUTION
  bottom: "deconv2"
  top: "deconv1"
  blobs_lr: 0
  blobs_lr: 0
  weight_decay: 1
  weight_decay: 0
  deconvolution_param {
    output_channels: 32
    output_height: 108
    output_width: 108
    pad: 2
    kernel_size: 5
    stride: 2
  }
}
layers {
  name: "relu_deconv1"
  type: RELU
  bottom: "deconv1"
  top: "deconv1"
  relu_param {
    negative_slope: 0.3
  }
}
layers {
  name: "deconv0"           
  type: DECONVOLUTION
  bottom: "deconv1"
  top: "deconv0"
  blobs_lr: 0
  blobs_lr: 0
  weight_decay: 1
  weight_decay: 0
  deconvolution_param {
    output_channels: 3
    output_height: 216 
    output_width: 216
    pad: 2
    kernel_size: 5
    stride: 2
  }
}

layers {
  name: "loss"
  type: EUCLIDEAN_LOSS
  bottom: "deconv0"
  bottom: "target_ims"
  #top: "loss"
}
